/*
// Array
let names = ["yuta", "tbn", "9lwa", ['a', 'b', 'c']];
console.log(names[3][1]);

names.push("gamal" , "ahmed") 

push == اضافة عناصر جديدة في الاخير 
pop(): تحذف آخر عنصر من المصفوفة (وتعطيك قيمته إذا أردت).

unshift(): تضيف عنصراً في أول مكان (وتدفع البقية للخلف).
shift(): تحذف أول عنصر (وتسحب البقية للأمام).

splice(1 , 2)في هده الحالة سوف يحدف 2 عناصر بعد العنصر يوتا
splice(1 , 0 , "yamada" , "add") في هده لحالة سوف يضيف عناصر بعد لعنصر يوتا ولن يحدف اي عنصر لان موجود رقم 0

indexOf("9lwa" ,1): تسألها "أين يوجد هذا العنصر؟" فتعطيك رقمه (Index). الفاصلة التي بعده تعني اين تريد ان يبدأ في لحساب
includes(): تسألها "هل هذا العنصر موجود؟" فتجيبك بـ نعم أو لا (True/False).


sort(): ترتب ليك الحروف و كدلك الارقام
reverse(): تعكس ترتيب العناصر
 
join(' ') التحكم مادا تريد ان يكون بين الكلمات و لعناصر


*/
